spec/vcr/Spree_Payment/_cancel_avalara/committed_order/should_be_successful/status_returns_Cancelled.yml

---
http_interactions:
- request:
    method: post
    uri: https://development.avalara.net/1.0/tax/get
    body:
      encoding: UTF-8
      string: '{"DocCode":"R033055011","DocDate":"2017-05-30","Discount":"0.0","Commit":false,"DocType":"SalesOrder","Addresses":[{"AddressCode":"Orig","Line1":"915
        S Jackson St","Line2":"","City":"Montgomery","Region":"AL","PostalCode":"36104","Country":"US"},{"AddressCode":"Dest","Line1":"915
        S Jackson St","Line2":"","City":"Montgomery","Region":"Alabama","Country":"US","PostalCode":"36104"}],"Lines":[{"LineNo":"1-LI","Description":"Product
        #1 - 6579","TaxCode":"PC030000","ItemCode":"SKU-1","Qty":1,"Amount":10.0,"OriginCode":"Orig","DestinationCode":"Dest","CustomerUsageType":null,"Discounted":false,"TaxIncluded":false}],"CustomerCode":1,"CompanyCode":"54321","CustomerUsageType":null,"ExemptionNo":null,"Client":"a0o33000004FH8l","ReferenceCode":"R033055011","DetailLevel":"Tax","CurrencyCode":"USD"}'
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      Authorization:
      - Basic MTEwMDExMzA5NjoxRDEzRURBMkRDQ0M3RTRB
      Content-Type:
      - application/json
      Content-Length:
      - '796'
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Cache-Control:
      - private
      Content-Type:
      - text/json; charset=utf-8
      Content-Encoding:
      - gzip
      Vary:
      - Accept-Encoding
      X-Aspnet-Version:
      - 4.0.30319
      X-Powered-By:
      - ASP.NET
      Date:
      - Tue, 30 May 2017 19:08:40 GMT
      Content-Length:
      - '559'
      Set-Cookie:
      - TS017f1821=01a8ddc44e70ad59abb47e5f73817199bd37896f7bdd7a9370e0a04a6938464ad096aaaa19cedc9357821730c324d1809e66aa74e6;
        Path=/
    body:
      encoding: ASCII-8BIT
      string: !binary |-
        H4sIAAAAAAAEAO29B2AcSZYlJi9tynt/SvVK1+B0oQiAYBMk2JBAEOzBiM3m
        kuwdaUcjKasqgcplVmVdZhZAzO2dvPfee++999577733ujudTif33/8/XGZk
        AWz2zkrayZ4hgKrIHz9+fB8/In5x8tGrvFmX7Uk1yz96lH70ej2d5k3z0Sj5
        6Gk1NZ++2rl3b+f+/Z3dXf3iadbyF3s7uw+2d+5v39vBF2+KRd602WIVfvVm
        9+GjnYNH+7vjnXt7B/cPHvwUN67arDxeVOtli+a7AgEfPi2aqfnYfXr6Ll+s
        2qJahh+/yd5lk5KR8UDQp/hkZ7zvf3SSldN1SajP/C+zd8+LZd7QR99LiB74
        40VFf320u/38TFsYQrw82bm3Q49+nE2Ksmiv8U1br3N8+oQwn2X19fP8Mi/x
        xfFsVitF+0PoDxVA/eG8InTx1854Z5865s+okXxkBjA0sKd5mxWlHdoJuqoZ
        3a9eo8mr/EKxOX6Ov7+zrovmzfWKe3zdEkD7qaHADrMAwX5fNBnKi2zBzY6f
        Hz85/uIYn1Mr92n6+s3xm9P0zfHv/dEvSb6f4P/SRKnopkk/oD8/erh7P32d
        fiebvm2qZfq6BVT92mD9lPgSH5/obH1RLduLapETMfBply4vK2Lj0rx879Pd
        HR5Cl1yEl3x0xnTf27m/9+DhQ3zDgzXvk9js7N7fBVV+STJ6b9y/rIsLfPxz
        j7uZjIj0/5Lk/wH8Xr60SwQAAA==
    http_version: 
  recorded_at: Tue, 30 May 2017 19:08:41 GMT
- request:
    method: post
    uri: https://development.avalara.net/1.0/tax/get
    body:
      encoding: UTF-8
      string: '{"DocCode":"R033055011","DocDate":"2017-05-30","Discount":"0.0","Commit":false,"DocType":"SalesOrder","Addresses":[{"AddressCode":"Orig","Line1":"915
        S Jackson St","Line2":"","City":"Montgomery","Region":"AL","PostalCode":"36104","Country":"US"},{"AddressCode":"Dest","Line1":"915
        S Jackson St","Line2":"","City":"Montgomery","Region":"Alabama","Country":"US","PostalCode":"36104"},{"AddressCode":"2","Line1":"1600
        Pennsylvania Ave NW","Line2":null,"City":"Washington","PostalCode":"20500","Country":"US"}],"Lines":[{"LineNo":"1-LI","Description":"Product
        #1 - 6579","TaxCode":"PC030000","ItemCode":"SKU-1","Qty":1,"Amount":10.0,"OriginCode":"2","DestinationCode":"Dest","CustomerUsageType":null,"Discounted":false,"TaxIncluded":false},{"LineNo":"1-FR","ItemCode":"Avalara
        Ground","Qty":1,"Amount":5.0,"OriginCode":"2","DestinationCode":"Dest","CustomerUsageType":null,"Description":"Shipping
        Charge","TaxCode":"FR000000","Discounted":false,"TaxIncluded":false}],"CustomerCode":1,"CompanyCode":"54321","CustomerUsageType":null,"ExemptionNo":null,"Client":"a0o33000004FH8l","ReferenceCode":"R033055011","DetailLevel":"Tax","CurrencyCode":"USD"}'
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      Authorization:
      - Basic MTEwMDExMzA5NjoxRDEzRURBMkRDQ0M3RTRB
      Content-Type:
      - application/json
      Content-Length:
      - '1143'
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Cache-Control:
      - private
      Content-Type:
      - text/json; charset=utf-8
      Content-Encoding:
      - gzip
      Vary:
      - Accept-Encoding
      X-Aspnet-Version:
      - 4.0.30319
      X-Powered-By:
      - ASP.NET
      Date:
      - Tue, 30 May 2017 19:08:40 GMT
      Content-Length:
      - '671'
      Set-Cookie:
      - TS017f1821=01a8ddc44ee13f1f751f1db03e572aa4650be6587d2350938db50501fb140b666f71305873d4fbc4ee7257f31f585c8fff453d8ce9;
        Path=/
    body:
      encoding: ASCII-8BIT
      string: !binary |-
        H4sIAAAAAAAEAO29B2AcSZYlJi9tynt/SvVK1+B0oQiAYBMk2JBAEOzBiM3m
        kuwdaUcjKasqgcplVmVdZhZAzO2dvPfee++999577733ujudTif33/8/XGZk
        AWz2zkrayZ4hgKrIHz9+fB8/In5x8tGrvFmX7Uk1yz96lH70ej2d5k3z0Sj5
        6Gk1NZ++2rl3b+f+/Z3dXf3iadbyF3s7uw+2d+5v39vBF2+KRd602WIVfvVm
        9+GjnYNH+7vjTw/u7x3s3fspbly1WXm8qNbLFs1379sPnxbN1HwscPHp6bt8
        sWqLahl+/CZ7l01KRsYDQZ/ik53xp/5HJ1k5XZeE+sz/Mnv3vFjmDX30vYTo
        gT9eVPTXR7vbz8+0hSHEy5Odezv06MfZpCiL9hrftPU6x6dPCPNZVl8/zy/z
        El8cz2a1UrQ/hP5QAVSHwx+8InTx1854Z5865s+okXy0r391B2Y+f5q3WVHa
        oZ2gq5rR/eo1mrzKLxSb4+f4+zvrumjeXK+4x9ctAbSfGgrsMAsQ7PdFk6G8
        yBbc7Pj58ZPjL47xObVyn6av3xy/OU3fHP/eH/2S5PvJL0lGhLY/I89e6TsG
        n2evqDd69OOf1Rlh/to40j39qzsh5vMfxoTcEksG4ih/y/n4fiJNlIZObPQD
        +vOjh7v309fpd7Lp26Zapq9bQNWvDdJPSU/g4xOdqy+qZXtRLXKiBT7tkuVl
        RWqlNC/f+3R3h1mqSy3CSz46Y7Lv7dzfe/DwIb7hwZr3SY3t7N7fBVWEwRQ5
        fLf76c5O+jJfLpvr8jJbFll6fJmnL74LINrMgGEqmgF8N2vmxfKiJXTw6eYB
        EGLUN30s2OKjpyf4uzOAh/t95Al3fQh5MxsRdfxLkv8HoOnMD9wFAAA=
    http_version: 
  recorded_at: Tue, 30 May 2017 19:08:41 GMT
- request:
    method: post
    uri: https://development.avalara.net/1.0/tax/get
    body:
      encoding: UTF-8
      string: '{"DocCode":"R033055011","DocDate":"2017-05-30","Discount":"0.0","Commit":true,"DocType":"SalesInvoice","Addresses":[{"AddressCode":"Orig","Line1":"915
        S Jackson St","Line2":"","City":"Montgomery","Region":"AL","PostalCode":"36104","Country":"US"},{"AddressCode":"Dest","Line1":"915
        S Jackson St","Line2":"","City":"Montgomery","Region":"Alabama","Country":"US","PostalCode":"36104"},{"AddressCode":"2","Line1":"1600
        Pennsylvania Ave NW","Line2":null,"City":"Washington","PostalCode":"20500","Country":"US"}],"Lines":[{"LineNo":"1-LI","Description":"Product
        #1 - 6579","TaxCode":"PC030000","ItemCode":"SKU-1","Qty":1,"Amount":10.0,"OriginCode":"2","DestinationCode":"Dest","CustomerUsageType":null,"Discounted":false,"TaxIncluded":false},{"LineNo":"1-FR","ItemCode":"Avalara
        Ground","Qty":1,"Amount":5.0,"OriginCode":"2","DestinationCode":"Dest","CustomerUsageType":null,"Description":"Shipping
        Charge","TaxCode":"FR000000","Discounted":false,"TaxIncluded":false}],"CustomerCode":1,"CompanyCode":"54321","CustomerUsageType":null,"ExemptionNo":null,"Client":"a0o33000004FH8l","ReferenceCode":"R033055011","DetailLevel":"Tax","CurrencyCode":"USD"}'
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      Authorization:
      - Basic MTEwMDExMzA5NjoxRDEzRURBMkRDQ0M3RTRB
      Content-Type:
      - application/json
      Content-Length:
      - '1144'
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Cache-Control:
      - private
      Content-Type:
      - text/json; charset=utf-8
      Content-Encoding:
      - gzip
      Vary:
      - Accept-Encoding
      X-Aspnet-Version:
      - 4.0.30319
      X-Powered-By:
      - ASP.NET
      Date:
      - Tue, 30 May 2017 19:08:42 GMT
      Content-Length:
      - '665'
      Set-Cookie:
      - TS017f1821=01a8ddc44ec1bc954a80344f4119c496ee2ba3adbd69596cbfcd46e398b936b6f9ae55a1b636cd964691508ba2611b93d917430702;
        Path=/
    body:
      encoding: ASCII-8BIT
      string: !binary |-
        H4sIAAAAAAAEAO29B2AcSZYlJi9tynt/SvVK1+B0oQiAYBMk2JBAEOzBiM3m
        kuwdaUcjKasqgcplVmVdZhZAzO2dvPfee++999577733ujudTif33/8/XGZk
        AWz2zkrayZ4hgKrIHz9+fB8/In5x8tGrvFmX7Uk1yz96lH70ej2d5k3z0Sj5
        6Gk1NZ++2rl3b+f+/Z3dXf3iadbyF3s7uw+2d+5v39vBF2+KRd602WIVfvVm
        9+GjnYNH+3vj+3vcrGqz8nhRrZctGu7etx8+LZqp+Vgg4tPTd/li1RbVMvz4
        TfYum5SMhgeCPsUnO+NP/Y9OsnK6Lgnpmf9l9u55scwb+uh7CVECf7yo6K+P
        drefn2kLQ4KXJzv3dujRj7NJURbtNb5p63WOT58Q5rOsvn6eX+YlvjiezWql
        ZX8I/aECqA6HP3hF6OKvnfHOPnXMn1Ej+Whf/+oOzHz+NG+zorRDO0FXNaP7
        1Ws0eZVfKDbHz/H3d9Z10by5XnGPr1sCaD81FNjhySfY74smQ3mRLbjZ8fPj
        J8dfHONzauU+TV+/OX5zmr45/r0/+iXJ95NfkowIbX9Gnr3Sdww+z15Rb/To
        xz+rM8L8tXGkwtmEXWdCzOc/jAm5JZYMxFH+lvPx/USaKA2d2OgH9OdHD3fv
        p6/T72TTt021TF+3gKpfG6SfkobAxyc6V19Uy/aiWuREC3zaJcvLihRKaV6+
        9+nuDrNUl1qEl3x0xmTf27m/9+DhQ3zDgzXvkwLb2b2/C6oIgyly+G73052d
        9GW+XDbX5WW2LLL0+DJPX3wXQLSZAcNUNAP4btbMi+VFS+jg080DIMSob/pY
        sMVHT0/wd2cAD/f7yBPu+hDyZjYiiviXJP8PIw/2EtYFAAA=
    http_version: 
  recorded_at: Tue, 30 May 2017 19:08:42 GMT
recorded_with: VCR 3.0.3
